package Stroki;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Scanner;

public class Strings {
    public static void main(String[] args) {

    /* Создайте программу, которая принимает две строки, содержащие числа, разделенные пробелами.
    Необходимо вывести на экран числа, которые встречаются и в первой, и во второй строке, без повторений.
     */
        Scanner sc = new Scanner(System.in);
        sc.nextInt();
        sc.nextInt();
        HashMap map = new HashMap();
        map.containsKey(sc);
        System.out.println(sc);

    }
}
